from random import randint
print("--------")
print("Здание 1")
print("--------")
list1 = list(input('Введите список цифр, в формате (хххххххххх): ')) #первый вариант реализации
    #list1 = [23, 145, 123, 31, 82, 35, 75] - второй вариант реализации
        #list1 = [] - третий вариант реализации
        #for i in range(10):
        #list1.append(randint(1, 100))
print("--------")
def sort(list1):
    for i in range(0, len(list1) - 1):
        for j in range(len(list1) - 1):
            if (list1[j] > list1[j + 1]):
                temp = list1[j]
                list1[j] = list1[j + 1]
                list1[j + 1] = temp
    return list1

print("Изначальный список: ", list1)
print("------------------------")
print("Отсортированный список: ", sort(list1))

print("\n--------")
print("Здание 2")
print("--------")

d = dict()
f = 1

while True:
    if f == 1:
        key = input("Введите ключ, в формате (xxxxxx): ")
        value = input("Введите значение, в формате (x, x, x): ")
        d[key] = value
        print("--------")
        print(f"Словарь: \n{d}")
        print("--------")
        print("----------------------------------------------------------------------------------")
        f = int(input("Для продолжения ввода значений нажмите - 1, для выхода из программы нажмите - 0: "))
        print("----------------------------------------------------------------------------------")
    else:
        print("Программа завершена!")
        break

print("--------")
print("Здание 3")
print("--------")

set1 = {1, 10, 34}
for i in range(5):
    set1.add(randint(-20,20))
print(f"Первый набор чисел: {set1}")

set2 = {1, 10, 34}
for i in range(5):
    set2.add(randint(-20, 20))
print(f"Второй набор чисел: {set2}")

set3 = set1 & set2
print(f"Элементы, которые входят в оба множества: {set3}")
set4 = set1 - set2
print(f"Элементы, которые входят только в первое множество, но не входят во второе: {set4}")
set5 = set2 - set1
print(f"Элементы, которые входят только во второе множество, но не входят в первое: {set5}")
set6 = set1 ^ set2
print(f"Элементы, которые входят в первое или во второе множества, но не в оба из них одновременно: {set6}")


