from random import randint

print("--------")
print("Здание 1")
print("--------")

list1 = list(input('Введите список цифр, в формате (хххххххххх): ')) 
print("--------")


# Функция сортировки списка методом пузырька
def sort(list1):
    for i in range(0, len(list1) - 1):
        for j in range(len(list1) - 1):
            if (list1[j] > list1[j + 1]):
                temp = list1[j]
                list1[j] = list1[j + 1]
                list1[j + 1] = temp
    return list1


print("Изначальный список: ", list1)
print("------------------------")
print("Отсортированный список: ", sort(list1))

print("\n--------")
print("Здание 2")
print("--------")

# Словарь
d = dict()

while True:
    if f:
        key = input("Введите ключ, в формате (xxxxxx): ")
        value = input("Введите значение, в формате (x, x, x): ")
        d[key] = value
        
        print("--------")
        print(f"Словарь: \n{d}")
        print("--------")
        
        print("----------------------------------------------------------------------------------")
        f = int(input("Для продолжения ввода значений нажмите - 1, для выхода из программы нажмите - 0: "))
        print("----------------------------------------------------------------------------------")
    else:
        print("Программа завершена!")
        break

print("--------")
print("Здание 3")
print("--------")

""" set 1 и set2 - два множества, 
    set3, set4, set5, set6 - множества, результаты операций над множествами set 1 и set2 """
set1 = {1, 10, 34}
for i in range(5):
    set1.add(randint(-20,20))
print(f"Первый набор чисел: {set1}")

set2 = {1, 10, 34}
for i in range(5):
    set2.add(randint(-20, 20))
print(f"Второй набор чисел: {set2}")

set3 = set1 & set2
print(f"Элементы, которые входят в оба множества: {set3}")
set4 = set1 - set2
print(f"Элементы, которые входят только в первое множество, но не входят во второе: {set4}")
set5 = set2 - set1
print(f"Элементы, которые входят только во второе множество, но не входят в первое: {set5}")
set6 = set1 ^ set2
print(f"Элементы, которые входят в первое или во второе множества, но не в оба из них одновременно: {set6}")


